[Survived] ArrowFunction
Todo with Tests/todo-app-with-tests/src/App.tsx:9:20
 
 import { TodoApp } from "./TodoApp"
 
-export const App = () => (
-  <ChakraProvider theme={theme}>
-    <TodoApp />
-  </ChakraProvider>
-)
+export const App = () => undefined
 
