[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/Logo.tsx:16:67
   to { transform: rotate(360deg); }
 `
 
-export const Logo = forwardRef<ImageProps, "img">((props, ref) => {
-  const prefersReducedMotion = usePrefersReducedMotion()
-
-  const animation = prefersReducedMotion
-    ? undefined
-    : `${spin} infinite 20s linear`
-
-  return <chakra.img animation={animation} src={logo} ref={ref} {...props} />
-})
+export const Logo = forwardRef<ImageProps, "img">((props, ref) => {})
 
