[Survived] BooleanLiteral
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:33:49
   item: TodoItem;
   deleteItem: () => void;
 }> = ({ item, deleteItem }) => {
-  const [isLiked, setLiked] = useState<boolean>(false);
+  const [isLiked, setLiked] = useState<boolean>(true);
   let likeButton;
   if (isLiked) {

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:35:7
 }> = ({ item, deleteItem }) => {
   const [isLiked, setLiked] = useState<boolean>(false);
   let likeButton;
-  if (isLiked) {
+  if (false) {
     likeButton = (
       <IconButton

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:35:16
 }> = ({ item, deleteItem }) => {
   const [isLiked, setLiked] = useState<boolean>(false);
   let likeButton;
-  if (isLiked) {
-    likeButton = (
-      <IconButton
-        aria-label="unlike"
-        icon={<AiFillHeart />}
-        onClick={() => {
-          setLiked(false);
-        }}
-      />
-    );
-  } else {
+  if (isLiked) {} else {
     likeButton = (
       <IconButton

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:40:24
       <IconButton
         aria-label="unlike"
         icon={<AiFillHeart />}
-        onClick={() => {
-          setLiked(false);
-        }}
+        onClick={() => {}}
       />
     );

[Survived] BooleanLiteral
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:41:20
         aria-label="unlike"
         icon={<AiFillHeart />}
         onClick={() => {
-          setLiked(false);
+          setLiked(true);
         }}
       />

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:45:10
         }}
       />
     );
-  } else {
-    likeButton = (
-      <IconButton
-        aria-label="like"
-        icon={<AiOutlineHeart />}
-        onClick={() => setLiked(true)}
-      />
-    );
-  }
+  } else {}
   return (
     <HStack>

[Survived] BooleanLiteral
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:50:33
       <IconButton
         aria-label="like"
         icon={<AiOutlineHeart />}
-        onClick={() => setLiked(true)}
+        onClick={() => setLiked(false)}
       />
     );

[Survived] ArrowFunction
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:50:18
       <IconButton
         aria-label="like"
         icon={<AiOutlineHeart />}
-        onClick={() => setLiked(true)}
+        onClick={() => undefined}
       />
     );

[Killed] BlockStatement
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:72:33
   const { register, handleSubmit, reset } = useForm<FormContents>();
 
   const addTodoItem = useCallback(
-    (contents: FormContents) => {
-      if (contents.itemDesc) {
-        const newItem = { title: contents.itemDesc, id: nanoid() };
-        setItems((oldItems) => oldItems.concat(newItem));
-        reset();
-      }
-    },
+    (contents: FormContents) => {},
     [setItems, reset]
   );
killedBy: TodoApp Adding todo items Adds the specified todo item to the list
statusReason: Error: Unable to find an element by: [data-testid="todoItem"]

<body
  class="chakra-ui-light"
>
  <div
    id="chakra-toast-portal"
  >

[Killed] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:73:11
 
   const addTodoItem = useCallback(
     (contents: FormContents) => {
-      if (contents.itemDesc) {
+      if (false) {
         const newItem = { title: contents.itemDesc, id: nanoid() };
         setItems((oldItems) => oldItems.concat(newItem));
killedBy: TodoApp Adding todo items Adds the specified todo item to the list
statusReason: Error: Unable to find an element by: [data-testid="todoItem"]

<body
  class="chakra-ui-light"
>
  <div
    id="chakra-toast-portal"
  >

[Killed] BlockStatement
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:73:30
 
   const addTodoItem = useCallback(
     (contents: FormContents) => {
-      if (contents.itemDesc) {
-        const newItem = { title: contents.itemDesc, id: nanoid() };
-        setItems((oldItems) => oldItems.concat(newItem));
-        reset();
-      }
+      if (contents.itemDesc) {}
     },
     [setItems, reset]
killedBy: TodoApp Adding todo items Adds the specified todo item to the list
statusReason: Error: Unable to find an element by: [data-testid="todoItem"]

<body
  class="chakra-ui-light"
>
  <div
    id="chakra-toast-portal"
  >

[Killed] ArrowFunction
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:75:18
     (contents: FormContents) => {
       if (contents.itemDesc) {
         const newItem = { title: contents.itemDesc, id: nanoid() };
-        setItems((oldItems) => oldItems.concat(newItem));
+        setItems(() => undefined);
         reset();
       }
killedBy: TodoApp Adding todo items Adds the specified todo item to the list
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:84:19
 
   const onSubmit = handleSubmit(addTodoItem);
 
-  useEffect(() => {
-    toast({
-      title: "Your items have changed!!",
-      status: "success",
-      duration: 1000,
-      isClosable: true,
-    });
-  }, [items, toast]);
+  useEffect(() => {}, [items, toast]);
 
   const deleteAllItems = useCallback(() => {

[Survived] StringLiteral
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:86:14
 
   useEffect(() => {
     toast({
-      title: "Your items have changed!!",
+      title: "",
       status: "success",
       duration: 1000,

[Survived] BooleanLiteral
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:89:19
       title: "Your items have changed!!",
       status: "success",
       duration: 1000,
-      isClosable: true,
+      isClosable: false,
     });
   }, [items, toast]);

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:93:44
     });
   }, [items, toast]);
 
-  const deleteAllItems = useCallback(() => {
-    setItems([]);
-  }, [setItems]);
+  const deleteAllItems = useCallback(() => {}, [setItems]);
 
   return (

[Survived] ArrayDeclaration
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:95:6
 
   const deleteAllItems = useCallback(() => {
     setItems([]);
-  }, [setItems]);
+  }, []);
 
   return (

[Killed] StringLiteral
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:110:26
           <FormLabel>TODO item:</FormLabel>
           <Input
             placeholder="Put TODO description here"
-            {...register("itemDesc")}
+            {...register("")}
           />
         </FormControl>
killedBy: TodoApp Adding todo items Adds the specified todo item to the list
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ArrowFunction
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:117:18
           Add TODO item
         </Button>
       </form>
-      {items.map((theItem) => (
-        <TodoItemComponent
-          item={theItem}
-          key={theItem.id}
-          deleteItem={() => {
-            setItems((oldItems) => oldItems.filter((i) => i !== theItem));
-          }}
-        />
-      ))}
+      {items.map(() => undefined)}
     </VStack>
   );
killedBy: TodoApp Adding todo items Adds the specified todo item to the list
statusReason: Error: Unable to find an element by: [data-testid="todoItem"]

<body
  class="chakra-ui-light"
>
  <div
    id="chakra-toast-portal"
  >

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:121:29
         <TodoItemComponent
           item={theItem}
           key={theItem.id}
-          deleteItem={() => {
-            setItems((oldItems) => oldItems.filter((i) => i !== theItem));
-          }}
+          deleteItem={() => {}}
         />
       ))}

[Survived] ArrowFunction
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:122:22
           item={theItem}
           key={theItem.id}
           deleteItem={() => {
-            setItems((oldItems) => oldItems.filter((i) => i !== theItem));
+            setItems(() => undefined);
           }}
         />

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/TodoApp.tsx:122:59
           item={theItem}
           key={theItem.id}
           deleteItem={() => {
-            setItems((oldItems) => oldItems.filter((i) => i !== theItem));
+            setItems((oldItems) => oldItems.filter((i) => false));
           }}
         />
