[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/reportWebVitals.ts:3:58
 import { ReportHandler } from "web-vitals"
 
-const reportWebVitals = (onPerfEntry?: ReportHandler) => {
-  if (onPerfEntry && onPerfEntry instanceof Function) {
-    import("web-vitals").then(({ getCLS, getFID, getFCP, getLCP, getTTFB }) => {
-      getCLS(onPerfEntry)
-      getFID(onPerfEntry)
-      getFCP(onPerfEntry)
-      getLCP(onPerfEntry)
-      getTTFB(onPerfEntry)
-    })
-  }
-}
+const reportWebVitals = (onPerfEntry?: ReportHandler) => {}
 
 export default reportWebVitals

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/reportWebVitals.ts:4:55
 import { ReportHandler } from "web-vitals"
 
 const reportWebVitals = (onPerfEntry?: ReportHandler) => {
-  if (onPerfEntry && onPerfEntry instanceof Function) {
-    import("web-vitals").then(({ getCLS, getFID, getFCP, getLCP, getTTFB }) => {
-      getCLS(onPerfEntry)
-      getFID(onPerfEntry)
-      getFCP(onPerfEntry)
-      getLCP(onPerfEntry)
-      getTTFB(onPerfEntry)
-    })
-  }
+  if (onPerfEntry && onPerfEntry instanceof Function) {}
 }
 

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/reportWebVitals.ts:5:80
 
 const reportWebVitals = (onPerfEntry?: ReportHandler) => {
   if (onPerfEntry && onPerfEntry instanceof Function) {
-    import("web-vitals").then(({ getCLS, getFID, getFCP, getLCP, getTTFB }) => {
-      getCLS(onPerfEntry)
-      getFID(onPerfEntry)
-      getFCP(onPerfEntry)
-      getLCP(onPerfEntry)
-      getTTFB(onPerfEntry)
-    })
+    import("web-vitals").then(({ getCLS, getFID, getFCP, getLCP, getTTFB }) => {})
   }
 }
