[Survived] LogicalOperator
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:14:3
 // opt-in, read https://cra.link/PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === "localhost" ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === "[::1]" ||
+  window.location.hostname === "localhost" && // [::1] is the IPv6 localhost address.
+window.location.hostname === "[::1]" ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:14:3
 // opt-in, read https://cra.link/PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === "localhost" ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === "[::1]" ||
-    // 127.0.0.0/8 are considered localhost for IPv4.
-    window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/,
-    ),
+  false,
 )
 

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:16:5
 const isLocalhost = Boolean(
   window.location.hostname === "localhost" ||
     // [::1] is the IPv6 localhost address.
-    window.location.hostname === "[::1]" ||
+    false ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(

[Survived] EqualityOperator
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:16:5
 const isLocalhost = Boolean(
   window.location.hostname === "localhost" ||
     // [::1] is the IPv6 localhost address.
-    window.location.hostname === "[::1]" ||
+    // [::1] is the IPv6 localhost address.
+window.location.hostname !== "[::1]" ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(

[Survived] Regex
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:19:7
     window.location.hostname === "[::1]" ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/,
+      /^127(?:\.(?:25[0-5]|2[^0-4][0-9]|[01]?[0-9][0-9]?)){3}$/,
     ),
 )

[Survived] Regex
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:19:7
     window.location.hostname === "[::1]" ||
     // 127.0.0.0/8 are considered localhost for IPv4.
     window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/,
+      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[^01]?[0-9][0-9]?)){3}$/,
     ),
 )

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:29:7
 }
 
 export function register(config?: Config) {
-  if (process.env.NODE_ENV === "production" && "serviceWorker" in navigator) {
+  if (false) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href)

[Survived] EqualityOperator
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:29:7
 }
 
 export function register(config?: Config) {
-  if (process.env.NODE_ENV === "production" && "serviceWorker" in navigator) {
+  if (process.env.NODE_ENV !== "production" && "serviceWorker" in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href)

[Survived] EqualityOperator
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:32:9
   if (process.env.NODE_ENV === "production" && "serviceWorker" in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href)
-    if (publicUrl.origin !== window.location.origin) {
+    if (publicUrl.origin === window.location.origin) {
       // Our service worker won't work if PUBLIC_URL is on a different origin
       // from what our page is served on. This might happen if a CDN is used to

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:32:9
   if (process.env.NODE_ENV === "production" && "serviceWorker" in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href)
-    if (publicUrl.origin !== window.location.origin) {
+    if (false) {
       // Our service worker won't work if PUBLIC_URL is on a different origin
       // from what our page is served on. This might happen if a CDN is used to

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:39:43
       return
     }
 
-    window.addEventListener("load", () => {
-      const swUrl = `${process.env.PUBLIC_URL}/service-worker.js`
-
-      if (isLocalhost) {
-        // This is running on localhost. Let's check if a service worker still exists or not.
-        checkValidServiceWorker(swUrl, config)
-
-        // Add some additional logging to localhost, pointing developers to the
-        // service worker/PWA documentation.
-        navigator.serviceWorker.ready.then(() => {
-          console.log(
-            "This web app is being served cache-first by a service " +
-              "worker. To learn more, visit https://cra.link/PWA",
-          )
-        })
-      } else {
-        // Is not localhost. Just register service worker
-        registerValidSW(swUrl, config)
-      }
-    })
+    window.addEventListener("load", () => {})
   }
 }

[Survived] StringLiteral
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:40:21
     }
 
     window.addEventListener("load", () => {
-      const swUrl = `${process.env.PUBLIC_URL}/service-worker.js`
+      const swUrl = ``
 
       if (isLocalhost) {

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:48:50
 
         // Add some additional logging to localhost, pointing developers to the
         // service worker/PWA documentation.
-        navigator.serviceWorker.ready.then(() => {
-          console.log(
-            "This web app is being served cache-first by a service " +
-              "worker. To learn more, visit https://cra.link/PWA",
-          )
-        })
+        navigator.serviceWorker.ready.then(() => {})
       } else {
         // Is not localhost. Just register service worker

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:54:14
               "worker. To learn more, visit https://cra.link/PWA",
           )
         })
-      } else {
-        // Is not localhost. Just register service worker
-        registerValidSW(swUrl, config)
-      }
+      } else {}
     })
   }

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:68:13
     .then((registration) => {
       registration.onupdatefound = () => {
         const installingWorker = registration.installing
-        if (installingWorker == null) {
+        if (true) {
           return
         }

[Survived] EqualityOperator
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:68:13
     .then((registration) => {
       registration.onupdatefound = () => {
         const installingWorker = registration.installing
-        if (installingWorker == null) {
+        if (installingWorker != null) {
           return
         }

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:72:15
           return
         }
         installingWorker.onstatechange = () => {
-          if (installingWorker.state === "installed") {
+          if (false) {
             if (navigator.serviceWorker.controller) {
               // At this point, the updated precached content has been fetched,

[Survived] EqualityOperator
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:72:15
           return
         }
         installingWorker.onstatechange = () => {
-          if (installingWorker.state === "installed") {
+          if (installingWorker.state !== "installed") {
             if (navigator.serviceWorker.controller) {
               // At this point, the updated precached content has been fetched,

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:73:17
         }
         installingWorker.onstatechange = () => {
           if (installingWorker.state === "installed") {
-            if (navigator.serviceWorker.controller) {
+            if (true) {
               // At this point, the updated precached content has been fetched,
               // but the previous service worker will still serve the older

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:73:17
         }
         installingWorker.onstatechange = () => {
           if (installingWorker.state === "installed") {
-            if (navigator.serviceWorker.controller) {
+            if (false) {
               // At this point, the updated precached content has been fetched,
               // but the previous service worker will still serve the older

[Survived] StringLiteral
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:78:17
               // but the previous service worker will still serve the older
               // content until all client tabs are closed.
               console.log(
-                "New content is available and will be used when all " +
+                "" +
                   "tabs for this page are closed. See https://cra.link/PWA.",
               )

[Survived] StringLiteral
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:79:19
               // content until all client tabs are closed.
               console.log(
                 "New content is available and will be used when all " +
-                  "tabs for this page are closed. See https://cra.link/PWA.",
+                  "",
               )
 

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:83:46
               )
 
               // Execute callback
-              if (config && config.onUpdate) {
-                config.onUpdate(registration)
-              }
+              if (config && config.onUpdate) {}
             } else {
               // At this point, everything has been precached.

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:86:20
               if (config && config.onUpdate) {
                 config.onUpdate(registration)
               }
-            } else {
-              // At this point, everything has been precached.
-              // It is the perfect time to display a
-              // "Content is cached for offline use." message.
-              console.log("Content is cached for offline use.")
-
-              // Execute callback
-              if (config && config.onSuccess) {
-                config.onSuccess(registration)
-              }
-            }
+            } else {}
           }
         }

[Survived] StringLiteral
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:90:27
               // At this point, everything has been precached.
               // It is the perfect time to display a
               // "Content is cached for offline use." message.
-              console.log("Content is cached for offline use.")
+              console.log("")
 
               // Execute callback

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:101:23
         }
       }
     })
-    .catch((error) => {
-      console.error("Error during service worker registration:", error)
-    })
+    .catch((error) => {})
 }
 

[Survived] StringLiteral
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:102:21
       }
     })
     .catch((error) => {
-      console.error("Error during service worker registration:", error)
+      console.error("", error)
     })
 }

[Survived] ObjectLiteral
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:108:16
 
 function checkValidServiceWorker(swUrl: string, config?: Config) {
   // Check if the service worker can be found. If it can't reload the page.
-  fetch(swUrl, {
-    headers: { "Service-Worker": "script" },
-  })
+  fetch(swUrl, {})
     .then((response) => {
       // Ensure service worker exists, and that we really are getting a JS file.

[Survived] ObjectLiteral
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:109:14
 function checkValidServiceWorker(swUrl: string, config?: Config) {
   // Check if the service worker can be found. If it can't reload the page.
   fetch(swUrl, {
-    headers: { "Service-Worker": "script" },
+    headers: {},
   })
     .then((response) => {

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:111:25
   fetch(swUrl, {
     headers: { "Service-Worker": "script" },
   })
-    .then((response) => {
-      // Ensure service worker exists, and that we really are getting a JS file.
-      const contentType = response.headers.get("content-type")
-      if (
-        response.status === 404 ||
-        (contentType != null && contentType.indexOf("javascript") === -1)
-      ) {
-        // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then((registration) => {
-          registration.unregister().then(() => {
-            window.location.reload()
-          })
-        })
-      } else {
-        // Service worker found. Proceed as normal.
-        registerValidSW(swUrl, config)
-      }
-    })
+    .then((response) => {})
     .catch(() => {
       console.log(

[Survived] StringLiteral
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:113:48
   })
     .then((response) => {
       // Ensure service worker exists, and that we really are getting a JS file.
-      const contentType = response.headers.get("content-type")
+      const contentType = response.headers.get("")
       if (
         response.status === 404 ||

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:115:9
       // Ensure service worker exists, and that we really are getting a JS file.
       const contentType = response.headers.get("content-type")
       if (
-        response.status === 404 ||
-        (contentType != null && contentType.indexOf("javascript") === -1)
+        false
       ) {
         // No service worker found. Probably a different app. Reload the page.

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:116:33
       const contentType = response.headers.get("content-type")
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf("javascript") === -1)
+        (contentType != null && true)
       ) {
         // No service worker found. Probably a different app. Reload the page.

[Survived] UnaryOperator
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:116:71
       const contentType = response.headers.get("content-type")
       if (
         response.status === 404 ||
-        (contentType != null && contentType.indexOf("javascript") === -1)
+        (contentType != null && contentType.indexOf("javascript") === +1)
       ) {
         // No service worker found. Probably a different app. Reload the page.

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:117:9
       if (
         response.status === 404 ||
         (contentType != null && contentType.indexOf("javascript") === -1)
-      ) {
-        // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then((registration) => {
-          registration.unregister().then(() => {
-            window.location.reload()
-          })
-        })
-      } else {
+      ) {} else {
         // Service worker found. Proceed as normal.
         registerValidSW(swUrl, config)

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:119:62
         (contentType != null && contentType.indexOf("javascript") === -1)
       ) {
         // No service worker found. Probably a different app. Reload the page.
-        navigator.serviceWorker.ready.then((registration) => {
-          registration.unregister().then(() => {
-            window.location.reload()
-          })
-        })
+        navigator.serviceWorker.ready.then((registration) => {})
       } else {
         // Service worker found. Proceed as normal.

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:120:48
       ) {
         // No service worker found. Probably a different app. Reload the page.
         navigator.serviceWorker.ready.then((registration) => {
-          registration.unregister().then(() => {
-            window.location.reload()
-          })
+          registration.unregister().then(() => {})
         })
       } else {

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:124:14
             window.location.reload()
           })
         })
-      } else {
-        // Service worker found. Proceed as normal.
-        registerValidSW(swUrl, config)
-      }
+      } else {}
     })
     .catch(() => {

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:129:18
         registerValidSW(swUrl, config)
       }
     })
-    .catch(() => {
-      console.log(
-        "No internet connection found. App is running in offline mode.",
-      )
-    })
+    .catch(() => {})
 }
 

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:136:30
     })
 }
 
-export function unregister() {
-  if ("serviceWorker" in navigator) {
-    navigator.serviceWorker.ready
-      .then((registration) => {
-        registration.unregister()
-      })
-      .catch((error) => {
-        console.error(error.message)
-      })
-  }
-}
+export function unregister() {}
 

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:137:37
 }
 
 export function unregister() {
-  if ("serviceWorker" in navigator) {
-    navigator.serviceWorker.ready
-      .then((registration) => {
-        registration.unregister()
-      })
-      .catch((error) => {
-        console.error(error.message)
-      })
-  }
+  if ("serviceWorker" in navigator) {}
 }
 

[Survived] ConditionalExpression
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:137:7
 }
 
 export function unregister() {
-  if ("serviceWorker" in navigator) {
+  if (false) {
     navigator.serviceWorker.ready
       .then((registration) => {

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:139:31
 export function unregister() {
   if ("serviceWorker" in navigator) {
     navigator.serviceWorker.ready
-      .then((registration) => {
-        registration.unregister()
-      })
+      .then((registration) => {})
       .catch((error) => {
         console.error(error.message)

[Survived] BlockStatement
Todo with Tests/todo-app-with-tests/src/serviceWorker.ts:142:25
       .then((registration) => {
         registration.unregister()
       })
-      .catch((error) => {
-        console.error(error.message)
-      })
+      .catch((error) => {})
   }
 }
