[Killed] ArrowFunction
Todo with Tests/todo-app-with-tests/src/test-utils.tsx:5:22
 import { render, RenderOptions } from "@testing-library/react"
 import { ChakraProvider, theme } from "@chakra-ui/react"
 
-const AllProviders = ({ children }: { children?: React.ReactNode }) => (
-  <ChakraProvider theme={theme}>{children}</ChakraProvider>
-)
+const AllProviders = () => undefined
 
 const customRender = (ui: React.ReactElement, options?: RenderOptions) =>
killedBy: TodoApp Adding todo items Adds the specified todo item to the list
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
Todo with Tests/todo-app-with-tests/src/test-utils.tsx:9:22
   <ChakraProvider theme={theme}>{children}</ChakraProvider>
 )
 
-const customRender = (ui: React.ReactElement, options?: RenderOptions) =>
-  render(ui, { wrapper: AllProviders, ...options })
+const customRender = () => undefined
 
 export { customRender as render }
killedBy: TodoApp Adding todo items Adds the specified todo item to the list
statusReason: TypeError: Cannot read properties of undefined (reading 'getByPlaceholderText')
